# Joshua Chavez
## Week 14  4/16/24
### Python - Python pandas grouping mapping applying

In [1]:
import numpy as np
from pandas import *
import pandas as pd

In [2]:
# Mapping
df = DataFrame({'city': ['Alma', 'Brian Head','Fox Park', 'Lake Mary'],
                'altitude': [10355,9800,9062,8966] }) 
df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [3]:
ds = {'Alma': 'Colorado', 'Brian Head': 'Utah',
     'Fox Park': 'Wyoming', 'Lake Mary': 'California'}
ds

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [4]:
df['state'] = df['city'].map(ds)
df

         city  altitude       state
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [5]:
# apply 
df1 = df.copy()
df['altitude']= df['altitude'].apply(lambda x:x /3.2808) # changing altitude from feet to meters.

In [6]:
df

         city     altitude       state
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323        Utah
2    Fox Park  2762.131188     Wyoming
3   Lake Mary  2732.870032  California

In [7]:
df['altitude']= df['altitude'].apply(lambda x: 0 if x < 2800 else x)
df

         city     altitude       state
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323        Utah
2    Fox Park     0.000000     Wyoming
3   Lake Mary     0.000000  California

In [9]:
df['altitude']= df['altitude'].apply(lambda x: np.nan if x < 2800 else x)
df

         city     altitude       state
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323        Utah
2    Fox Park          NaN     Wyoming
3   Lake Mary          NaN  California

In [10]:
# apply 
df = DataFrame(np.random.randn(4,3), 
               columns = list('bde'), 
               index = ['UT', 'OH', 'TX', 'OR'])
df

           b         d         e
UT  1.124822 -0.155445 -1.310908
OH -0.214039 -0.818734  0.572073
TX  0.766106  0.395610 -0.053993
OR  0.420117 -0.007798 -0.530477

In [11]:
df.apply(lambda x:x.max() - x.min())

b    1.338861
d    1.214344
e    1.882981
dtype: float64

In [12]:
df['d'].max()

0.3956097461309572

In [13]:
df['d'].min()

-0.8187344755372811

In [14]:
df.iloc[0].max()

1.12482239131331

In [15]:
df.apply(lambda x:x.max() - x.min(), axis=1)

UT    2.435731
OH    1.390807
TX    0.820099
OR    0.950593
dtype: float64

In [22]:
df.apply(pd.value_counts)

             b    d    e
-1.310908  NaN  NaN  1.0
-0.818734  NaN  1.0  NaN
-0.530477  NaN  NaN  1.0
-0.214039  1.0  NaN  NaN
-0.155445  NaN  1.0  NaN
-0.053993  NaN  NaN  1.0
-0.007798  NaN  1.0  NaN
 0.395610  NaN  1.0  NaN
 0.420117  1.0  NaN  NaN
 0.572073  NaN  NaN  1.0
 0.766106  1.0  NaN  NaN
 1.124822  1.0  NaN  NaN

In [20]:
df['b'].value_counts()

-0.214039    1
 0.766106    1
 0.420117    1
 1.124822    1
Name: b, dtype: int64

In [23]:
df.apply(pd.value_counts).fillna(0).astype(int)

           b  d  e
-1.310908  0  0  1
-0.818734  0  1  0
-0.530477  0  0  1
-0.214039  1  0  0
-0.155445  0  1  0
-0.053993  0  0  1
-0.007798  0  1  0
 0.395610  0  1  0
 0.420117  1  0  0
 0.572073  0  0  1
 0.766106  1  0  0
 1.124822  1  0  0

In [24]:
df.apply(pd.value_counts,axis = 1).fillna(0).astype(int)

,-1.310908,-0.818734,-0.530477,-0.214039,-0.155445,-0.053993,-0.007798,0.395610,0.420117,0.572073,0.766106,1.124822
UT,1,0,0,0,1,0,0,0,0,0,0,1
OH,0,1,0,1,0,0,0,0,0,1,0,0
TX,0,0,0,0,0,1,0,1,0,0,1,0
OR,0,0,1,0,0,0,1,0,1,0,0,0

In [27]:
#groupby 
# grouping the data points (i.e. rows) based on the distinct values
df = DataFrame({'brand': ['Toyota','Ford', 'GMC', 'Ford', 'Toyota', 'GMC'],
                          'price': [40000, 20000,30000,6000,32000,45000]})
df

    brand  price
0  Toyota  40000
1    Ford  20000
2     GMC  30000
3    Ford   6000
4  Toyota  32000
5     GMC  45000

In [28]:
df.groupby('brand').sum()

        price
brand
Ford    26000
GMC     75000
Toyota  72000

In [29]:
df.groupby('brand').count()

        price
brand
Ford        2
GMC         2
Toyota      2

In [30]:
df.groupby('brand').mean()

        price
brand
Ford    13000
GMC     37500
Toyota  36000

In [31]:
df

    brand  price
0  Toyota  40000
1    Ford  20000
2     GMC  30000
3    Ford   6000
4  Toyota  32000
5     GMC  45000

In [32]:
g = df.groupby('brand').count()

In [33]:
type(g)

pandas.core.frame.DataFrame

In [34]:
g

        price
brand
Ford        2
GMC         2
Toyota      2

In [36]:
g = df.groupby('brand')
g

In [40]:
g.sum

In [43]:
g = df.groupby('brand').sum()
g

        price
brand
Ford    26000
GMC     75000
Toyota  72000

In [44]:
g.sum

<bound method DataFrame.sum of         price
brand
Ford    26000
GMC     75000
Toyota  72000>

In [38]:
df.groupby('brand')['price'].mean()

brand
Ford      13000
GMC       37500
Toyota    36000
Name: price, dtype: int64

In [39]:
type(df.groupby('brand')['price'].mean())

pandas.core.series.Series

In [45]:
df.groupby('brand')['price'].mean()

brand
Ford      13000
GMC       37500
Toyota    36000
Name: price, dtype: int64

In [47]:
df['cum_sum'] =  df.groupby('brand')['price'].cumsum() # cummulative sum for the same name or same key word of the data dictionaries 
df

    brand  price  cum_sum
0  Toyota  40000    40000
1    Ford  20000    20000
2     GMC  30000    30000
3    Ford   6000    26000
4  Toyota  32000    72000
5     GMC  45000    75000

In [54]:
df = DataFrame({'date': pd.date_range(start = "2024-04-18",periods = 8),
                "category": list("ABABBABA"),
                "value": np.random.randint(10,30, size = 8)})
df

        date category  value
0 2024-04-18        A     10
1 2024-04-19        B     18
2 2024-04-20        A     22
3 2024-04-21        B     10
4 2024-04-22        B     14
5 2024-04-23        A     15
6 2024-04-24        B     14
7 2024-04-25        A     29

In [57]:
df1 = df.copy()
df['cum_sum'] =  df['value'].cumsum()
df

        date category  value  cum_sum
0 2024-04-18        A     10       10
1 2024-04-19        B     18       28
2 2024-04-20        A     22       50
3 2024-04-21        B     10       60
4 2024-04-22        B     14       74
5 2024-04-23        A     15       89
6 2024-04-24        B     14      103
7 2024-04-25        A     29      132

In [59]:
df['cum_sum'] =  df.groupby("category")['value'].cumsum()
df

        date category  value  cum_sum
0 2024-04-18        A     10       10
1 2024-04-19        B     18       18
2 2024-04-20        A     22       32
3 2024-04-21        B     10       28
4 2024-04-22        B     14       42
5 2024-04-23        A     15       47
6 2024-04-24        B     14       56
7 2024-04-25        A     29       76

In [60]:
df.groupby('category').sum()

          value  cum_sum
category
A            76      165
B            56      144

In [62]:
df.groupby('category')[['value']].sum()

          value
category
A            76
B            56

In [63]:
df.groupby('value').sum()

       cum_sum
value
10          38
14          98
15          47
18          18
22          32
29          76

In [64]:
df

        date category  value  cum_sum
0 2024-04-18        A     10       10
1 2024-04-19        B     18       18
2 2024-04-20        A     22       32
3 2024-04-21        B     10       28
4 2024-04-22        B     14       42
5 2024-04-23        A     15       47
6 2024-04-24        B     14       56
7 2024-04-25        A     29       76

In [65]:
df = DataFrame({'k1': ['a', 'a','b','b','c'],
               'k2': ['one','two', 'one', 'two', 'one'],
               'dataset1': np.random.randn(5),
                'dataset2': np.random.randn(5)
               })
df

  k1   k2  dataset1  dataset2
0  a  one -0.690230  0.499823
1  a  two -0.161362 -0.738459
2  b  one -1.896521 -0.477152
3  b  two  0.103588  1.309524
4  c  one -1.482706 -0.472723

In [66]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [67]:
df.groupby('k1').sum()

    dataset1  dataset2
k1
a  -0.851591 -0.238636
b  -1.792933  0.832372
c  -1.482706 -0.472723

In [68]:
df.groupby('k2').sum()

     dataset1  dataset2
k2
one -4.069457 -0.450052
two -0.057773  0.571065

In [70]:
df.groupby(['k1','k2']).sum()

        dataset1  dataset2
k1 k2
a  one -0.690230  0.499823
   two -0.161362 -0.738459
b  one -1.896521 -0.477152
   two  0.103588  1.309524
c  one -1.482706 -0.472723